## DataFrames

In [5]:
import pandas as pd
import numpy as np

from numpy.random import randn
np.random.seed(101)

In [13]:
df = pd.DataFrame(data=randn(5,4),index=["A", "B", "C", "D", "E"],columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.188695 -0.758872 -0.933237  0.955057
B  0.190794  1.978757  2.605967  0.683509
C  0.302665  1.693723 -1.706086 -1.159119
D -0.134841  0.390528  0.166905  0.184502
E  0.807706  0.072960  0.638787  0.329646

## Selection and Index

In [28]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [29]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [30]:
df[["X", "Y"]]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237
E  1.978757  2.605967

In [35]:
type(df[["Z"]])

pandas.core.frame.DataFrame

In [36]:
type(df["Z"])

pandas.core.series.Series

In [37]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df["new_col"] = df["W"] + df["Y"]
df

          W         X         Y         Z   new_col
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [53]:
df.drop("new_col", axis = 1, inplace = True)

In [54]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
df.loc["A"]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [56]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [57]:
df.loc["B", "Y"]

-0.8480769834036315

In [58]:
df.iloc[1, 2]

-0.8480769834036315

In [59]:
df.loc[["B", "C"], ["X", "Y"]]

          X         Y
B -0.319318 -0.848077
C  0.740122  0.528813

In [63]:
df.iloc[:, 1:3]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237
E  1.978757  2.605967

## Condtitional selection

In [64]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [66]:
bool=df>0

In [67]:
df[bool]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [68]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [69]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
df[df["W"]>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [75]:
df.loc["B"]<0

W    False
X     True
Y     True
Z    False
Name: B, dtype: bool

In [76]:
2>1 and 3>1

True

In [81]:
df[(df["W"]>0) & (df["X"]>0)]["Y"]

A    0.907969
E    2.605967
Name: Y, dtype: float64

In [14]:
df

          W         X         Y         Z
A  0.188695 -0.758872 -0.933237  0.955057
B  0.190794  1.978757  2.605967  0.683509
C  0.302665  1.693723 -1.706086 -1.159119
D -0.134841  0.390528  0.166905  0.184502
E  0.807706  0.072960  0.638787  0.329646

In [15]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [86]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [16]:
df.reset_index(inplace=True)

In [17]:
df

  index         W         X         Y         Z
0     A  0.188695 -0.758872 -0.933237  0.955057
1     B  0.190794  1.978757  2.605967  0.683509
2     C  0.302665  1.693723 -1.706086 -1.159119
3     D -0.134841  0.390528  0.166905  0.184502
4     E  0.807706  0.072960  0.638787  0.329646

In [18]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [97]:
states = ["DN", "QB", "HCM", "HN", "QT"]

In [98]:
df["City"] = states

In [99]:
df

  index         W         X         Y         Z City
0     A  2.706850  0.628133  0.907969  0.503826   DN
1     B  0.651118 -0.319318 -0.848077  0.605965   QB
2     C -2.018168  0.740122  0.528813 -0.589001  HCM
3     D  0.188695 -0.758872 -0.933237  0.955057   HN
4     E  0.190794  1.978757  2.605967  0.683509   QT

In [102]:
df.set_index("City", inplace=True)

In [103]:
df

     index         W         X         Y         Z
City
DN       A  2.706850  0.628133  0.907969  0.503826
QB       B  0.651118 -0.319318 -0.848077  0.605965
HCM      C -2.018168  0.740122  0.528813 -0.589001
HN       D  0.188695 -0.758872 -0.933237  0.955057
QT       E  0.190794  1.978757  2.605967  0.683509

In [104]:
df.columns

Index(['index', 'W', 'X', 'Y', 'Z'], dtype='object')

In [105]:
df.rename(columns={"index": "string"})

     string         W         X         Y         Z
City
DN        A  2.706850  0.628133  0.907969  0.503826
QB        B  0.651118 -0.319318 -0.848077  0.605965
HCM       C -2.018168  0.740122  0.528813 -0.589001
HN        D  0.188695 -0.758872 -0.933237  0.955057
QT        E  0.190794  1.978757  2.605967  0.683509

## Multi-Index

In [6]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(index)

In [7]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [20]:
df = pd.DataFrame(np.random.randn(6,2),index=[("G1", 1), ('G1', 2), ('G1', 3), ("G2", 1), ("G2", 2), ("G3", 3)],columns=['A','B'])

                A         B
(G1, 1)  1.025984 -0.156598
(G1, 2) -0.031579  0.649826
(G1, 3)  2.154846 -0.610259
(G2, 1) -0.755325 -0.346419
(G2, 2)  0.147027 -0.479448
(G3, 3)  0.558769  1.024810

In [22]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -1.005187 -0.741790
   2  0.187125 -0.732845
   3 -1.382920  1.482495
G2 1  0.961458 -2.141212
   2  0.992573  1.192241
   3 -1.046780  1.292765

In [10]:
df1 = df.loc["G1"]
df1

          A         B
1  2.706850  0.628133
2  0.907969  0.503826
3  0.651118 -0.319318

In [12]:
df.loc["G1"].iloc[1, 0]

0.9079694464765431

In [23]:
df

             A         B
G1 1 -1.005187 -0.741790
   2  0.187125 -0.732845
   3 -1.382920  1.482495
G2 1  0.961458 -2.141212
   2  0.992573  1.192241
   3 -1.046780  1.292765

In [25]:
df.index.names

FrozenList([None, None])

In [26]:
df.index.names = ["Group", "Number"]

In [27]:
df

                     A         B
Group Number
G1    1      -1.005187 -0.741790
      2       0.187125 -0.732845
      3      -1.382920  1.482495
G2    1       0.961458 -2.141212
      2       0.992573  1.192241
      3      -1.046780  1.292765

In [28]:
df.xs("G1")

               A         B
Number
1      -1.005187 -0.741790
2       0.187125 -0.732845
3      -1.382920  1.482495

In [29]:
df.xs(("G1", 1))

A   -1.005187
B   -0.741790
Name: (G1, 1), dtype: float64

In [31]:
df.xs(1, level = "Number")

              A         B
Group
G1    -1.005187 -0.741790
G2     0.961458 -2.141212

In [32]:
df.xs("G2", level = "Group")

               A         B
Number
1       0.961458 -2.141212
2       0.992573  1.192241
3      -1.046780  1.292765

## Groupby

In [33]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df_gb = pd.DataFrame(data)
df_gb

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [37]:
df_gb.groupby("Company").mean(numeric_only=True)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [38]:
df_gb.groupby("Company").std(numeric_only=True)

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [39]:
df_gb.groupby("Company").min(numeric_only=True)

         Sales
Company
FB         243
GOOG       120
MSFT       124

In [40]:
df_gb.groupby("Company").max(numeric_only=True)

         Sales
Company
FB         350
GOOG       200
MSFT       340

In [43]:
df_gb

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [47]:
df_gb.groupby("Company").describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [49]:
df_gb.groupby("Company").describe().transpose()["GOOG"]

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [50]:
df_gb.groupby("Company").describe().transpose().iloc[:, 2]

Sales  count      2.000000
       mean     232.000000
       std      152.735065
       min      124.000000
       25%      178.000000
       50%      232.000000
       75%      286.000000
       max      340.000000
Name: MSFT, dtype: float64

## Merging..

In [52]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [53]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [54]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [55]:
df4 = pd.DataFrame({'A': ['A12', 'A13', 'A14', 'A15'],
                        'B': ['B12', 'B13', 'B14', 'B15'],
                        'C': ['C12', 'C13', 'C14', 'C15'],
                        'E': ['E12', 'E13', 'E14', 'E15']},
                        index=[12, 13, 14, 15])
df4

      A    B    C    E
12  A12  B12  C12  E12
13  A13  B13  C13  E13
14  A14  B14  C14  E14
15  A15  B15  C15  E15

In [56]:
df5 = pd.DataFrame({'A': ['A16', 'A17', 'A18', 'A19'],
                        'B': ['B16', 'B17', 'B18', 'B19'],
                        'C': ['C16', 'C17', 'C18', 'C19'],
                        'D': ['D16', 'D17', 'D18', 'D19']},
                        index=[0, 1, 2, 3])
df5

     A    B    C    D
0  A16  B16  C16  D16
1  A17  B17  C17  D17
2  A18  B18  C18  D18
3  A19  B19  C19  D19

In [57]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [58]:
pd.concat([df1, df2, df4])

      A    B    C    D    E
0    A0   B0   C0   D0  NaN
1    A1   B1   C1   D1  NaN
2    A2   B2   C2   D2  NaN
3    A3   B3   C3   D3  NaN
4    A4   B4   C4   D4  NaN
5    A5   B5   C5   D5  NaN
6    A6   B6   C6   D6  NaN
7    A7   B7   C7   D7  NaN
12  A12  B12  C12  NaN  E12
13  A13  B13  C13  NaN  E13
14  A14  B14  C14  NaN  E14
15  A15  B15  C15  NaN  E15

In [67]:
pd.concat([df1, df5], axis=1)

    A   B   C   D    A    B    C    D
0  A0  B0  C0  D0  A16  B16  C16  D16
1  A1  B1  C1  D1  A17  B17  C17  D17
2  A2  B2  C2  D2  A18  B18  C18  D18
3  A3  B3  C3  D3  A19  B19  C19  D19

In [68]:
data1 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

data2 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K4'],
                          'C': ['C0', 'C1', 'C2', 'C4'],
                          'D': ['D0', 'D1', 'D2', 'D4']})

In [69]:
data1

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [70]:
data2

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K4  C4  D4

In [73]:
pd.concat([data1, data2[["C", "D"]]], axis = 1)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C4  D4

In [85]:
pd.merge(data1, data2, on = "key", how = "outer")

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2   C2   D2
3  K3   A3   B3  NaN  NaN
4  K4  NaN  NaN   C4   D4

In [75]:
data3 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
data4 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [76]:
data3

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [77]:
data4

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [87]:
pd.merge(data3, data4, on = ["key1", "key2"], how = "outer")

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [93]:
data5 = pd.DataFrame({'key11': ['K0', 'K0', 'K1', 'K2'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
data6 = pd.DataFrame({'key21': ['K0', 'K1', 'K1', 'K2'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [94]:
data5

  key11   A   B
0    K0  A0  B0
1    K0  A1  B1
2    K1  A2  B2
3    K2  A3  B3

In [95]:
data6

  key21   C   D
0    K0  C0  D0
1    K1  C1  D1
2    K1  C2  D2
3    K2  C3  D3

In [102]:
#key11 - data5 = key21 - data6
pd.merge(data5, data6, left_on = "key11", right_on = "key21", how = "outer")

  key11   A   B key21   C   D
0    K0  A0  B0    K0  C0  D0
1    K0  A1  B1    K0  C0  D0
2    K1  A2  B2    K1  C1  D1
3    K1  A2  B2    K1  C2  D2
4    K2  A3  B3    K2  C3  D3

In [107]:
data5.merge(data6, left_on = "key11", right_on = "key21", how = "outer")

  key11   A   B key21   C   D
0    K0  A0  B0    K0  C0  D0
1    K0  A1  B1    K0  C0  D0
2    K1  A2  B2    K1  C1  D1
3    K1  A2  B2    K1  C2  D2
4    K2  A3  B3    K2  C3  D3

**Join**

In [103]:
df_join1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

df_join2 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [104]:
df_join1

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [105]:
df_join2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [110]:
df_join1.join(df_join2)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

## Operations

In [115]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def',np.nan,'xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  NaN
3     4   444  xyz

In [116]:
df["col2"].unique()

array([444, 555, 666])

In [117]:
df["col2"].nunique()

3

In [118]:
df["col2"].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [121]:
df[(df["col1"]>2) | (df["col2"]==444)]

   col1  col2 col3
0     1   444  abc
2     3   666  NaN
3     4   444  xyz

## Applying functions

In [122]:
def times2(x):
    return x*2

In [123]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  NaN
3     4   444  xyz

In [124]:
df["col1"].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [125]:
df["col1"].apply(lambda d: d*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [129]:
df[["col1","col2"]].apply(np.sum, axis=1)

0    445
1    557
2    669
3    448
dtype: int64

In [133]:
df["col1"].max()

4

In [134]:
del df["col1"]
df

   col2 col3
0   444  abc
1   555  def
2   666  NaN
3   444  xyz

In [135]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [136]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [137]:
df.sort_values(by="col2")

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  NaN

In [138]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False   True
3  False  False

In [141]:
df.dropna(axis=0)

   col2 col3
0   444  abc
1   555  def
3   444  xyz

In [142]:
df

   col2 col3
0   444  abc
1   555  def
2   666  NaN
3   444  xyz

In [143]:
df.fillna("FILL")

   col2  col3
0   444   abc
1   555   def
2   666  FILL
3   444   xyz

**pivot_table**

In [144]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [145]:
df.pivot_table(values = "D", index=["A", "B"], columns="C")

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Input Output

In [146]:
pwd

'/Users/loandoan/Desktop/DataScience_Beginner/Python Pandas'

In [153]:
example = pd.read_csv("/Users/loandoan/Desktop/DataScience_Beginner/example")

In [155]:
example["e"] = example["a"] + example["b"]
example

    a   b   c   d   e
0   0   1   2   3   1
1   4   5   6   7   9
2   8   9  10  11  17
3  12  13  14  15  25

In [163]:
example.to_csv("output", index=False)

In [164]:
output = pd.read_csv("output")

In [165]:
output

    a   b   c   d   e
0   0   1   2   3   1
1   4   5   6   7   9
2   8   9  10  11  17
3  12  13  14  15  25